tutorials/heatTransfer/chtMultiRegionFoam/snappyMultiRegionHeater/system/leftSolid/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 300;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
                value           $internalField;
            }
            minZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            maxZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_bottomAir
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourFieldName T;
                Kappa               Kappa;
                value           $internalField;

            }
            leftSolid_to_heater
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourFieldName T;
                Kappa               Kappa;
                value           $internalField;
            }
            leftSolid_to_topAir
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourFieldName T;
                Kappa               Kappa;
                value           $internalField;
            }
        }
    }

    rho
    {
        internalField   uniform 8000;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
                value           $internalField;
            }
            minZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            maxZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_bottomAir
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_heater
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_topAir
            {
                type            zeroGradient;
                value           $internalField;
            }
        }
    }

    Kappa
    {
        internalField   uniform 80;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
                value           $internalField;
            }
            minZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            maxZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_bottomAir
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_heater
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_topAir
            {
                type            zeroGradient;
                value           $internalField;
            }
        }
    }

    cp
    {
        internalField   uniform 450;

        boundaryField
        {
            minX
            {
                type            zeroGradient;
                value           $internalField;
            }
            minZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            maxZ
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_bottomAir
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_heater
            {
                type            zeroGradient;
                value           $internalField;
            }
            leftSolid_to_topAir
            {
                type            zeroGradient;
                value           $internalField;
            }
        }
    }
}


// ************************************************************************* //
